Revit 2024 API
CableTrayConduitBase.RunId Property
 The id of the run to which this element belongs.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId RunId { get; }
Visual Basic
Public ReadOnly Property RunId As ElementId
	Get
Visual C++
public:
property ElementId^ RunId {
	ElementId^ get ();
}
See Also
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace